---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamThermalConductivityX
source: html/0ed06cbf-882d-4bb4-b348-1427acebce52.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamThermalConductivityX Property

"Thermal Conductivity X"

## Syntax (C#)
```csharp
public static ForgeTypeId PhyMaterialParamThermalConductivityX { get; }
```